{
    "problemWrapUp": "The spider whips a non-sticky web around you and yanks you out of the web, up to the top of the shag carpet, which seems to have fused together enough to form paths in and out of the room.", 
    "name": "Shag Carpet Room", 
    "exits": [
        {
            "direction": "north", 
            "roomID": "", 
            "description": "To the Nouth you see innumerably thick strands of shag carpet which seem to have fused together through years of dirt and spilled drinks."
        }, 
        {
            "direction": "northeast", 
            "roomID": "", 
            "description": "To the Northeast you see innumerably thick strands of shag carpet which seem to have fused together through years of dirt and spilled drinks.."
        }, 
        {
            "direction": "east", 
            "roomID": "", 
            "description": "To the East you see innumerably thick strands of shag carpet which seem to have fused together through years of dirt and spilled drinks.."
        }, 
        {
            "direction": "southeast", 
            "roomID": "", 
            "description": "To the Southeast you see innumerably thick strands of shag carpet which seem to have fused together through years of dirt and spilled drinks.."
        }, 
        {
            "direction": "south", 
            "roomID": "", 
            "description": "To the South you see innumerably thick strands of shag carpet which seem to have fused together through years of dirt and spilled drinks."
        }, 
        {
            "direction": "southwest", 
            "roomID": "", 
            "description": "To the Southwest is a steep cliff."
        }, 
        {
            "direction": "west", 
            "roomID": "", 
            "description": "To the west is the door to your lab, but the spider's web prevents you from moving."
        }, 
        {
            "direction": "northwest", 
            "roomID": "", 
            "description": "To the Northwest you see an off-white wall."
        }, 
        {
            "direction": "up", 
            "roomID": "", 
            "description": "You look up and see the ceiling"
        }, 
        {
            "direction": "down", 
            "roomID": "", 
            "description": "You look down and see carpet."
        }
    ], 
    "items": [
        "spider"
    ], 
    "problemDescription": "Apparently a spider has laid itself a nest amidst this ugly shag carpet, and you've walked right into its web.  Your guess as to the origins of the web prove terrifyingly accurate as a large black specimen slowly drops down from above.  Surprisingly it offers to pull you out of its web without eating you, but it requires you to solve a problem for it.", 
    "nextState": "room2-1", 
    "record_type": "room", 
    "_id": "room2", 
    "description": "You are standing atop the carpet, which years of dirt and spilled soda has stuck together into a narrow pathway with many forks and bends.
      In the North and East directions you see the path curve off to more rooms, while to the South you see a tiny crack in the wall you could just barely squeeze through."
}