{
    "problemWrapUp": "As soon as you answer the question, the wand reverberates in your hand, and you instinctively tap the vial with it.  The powder pops and fizzles as it undergoes a change of state from solid to liquid.  You hesitate for a moment before closing your eyes and gulping down the contents of the vial.  Immediately your nerves being to tingle like fire, wracking your body with pain.  You pass out... <br/>When you awaken, you feel larger, and find yourself in a different place entirely.", 
    "name": "Combining Room", 
    "exits": [
        {
            "direction": "north", 
            "roomID": "room5", 
            "description": "You go to the mystery room."
        }, 
        {
            "direction": "northeast", 
            "roomID": "", 
            "description": "You can not head this direction."
        }, 
        {
            "direction": "east", 
            "roomID": "", 
            "description": "You can not head this direction."
        }, 
        {
            "direction": "southeast", 
            "roomID": "", 
            "description": "You can not head this direction."
        }, 
        {
            "direction": "south", 
            "roomID": "", 
            "description": "You can not go this direction."
        }, 
        {
            "direction": "southwest", 
            "roomID": "room8", 
            "description": "You go to the ant hill."
        }, 
        {
            "direction": "west", 
            "roomID": "room3", 
            "description": "You go to the great outdoors."
        }, 
        {
            "direction": "northwest", 
            "roomID": "room4", 
            "description": "You go to the tile room."
        }, 
        {
            "direction": "up", 
            "roomID": "", 
            "description": "You see the ceiling."
        }, 
        {
            "direction": "down", 
            "roomID": "", 
            "description": "You see the hard wood floor."
        }
    ], 
    "items": [
    "wizard"
    ], 
    "problemDescription": "The man in the wide-brimmed hat approaches you in an intimidating manner, sizing you up as it were.  'I see you have the proper items gathered.  Take this wand in exchange for your pebble, and put the powder into the vial.  After answering the following question, tap the vial with the wand and you shall have a cure to your ailment.'  The man hands you the wand, and presents a problem.", 
    "nextState": "room11", 
    "record_type": "room", 
    "_id": "room10", 
    "description": "You are in the only room of a cozy little log cabin, lighted by paper lanterns hanging from the ceiling.  Empty door frames stand in front of the walls in each of the cardinal directions, and no apparent exit.  The cabin is lined with bookshelves, armoires, and desks, each brimming with papers and books.  The whole room could do with a good dusting."
}